app/controllers/posts_controller.rb

	def index
    @posts = Post.all
		@posts = Post.order(created_at: :desc).page(params[:page])
---
SELECT "posts".* FROM "posts"
SELECT  "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC LIMIT 25 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "posts" LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 10], ["OFFSET", 0]]